Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: You need to define a bean implementing the link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnUserProvider.html[`WebAuthnUserProvider`] in order to allow the Quarkus WebAuthn extension to load and store credentials. This is where you tell Quarkus how to turn your data model into the WebAuthn security model:
ja_jp: Quarkus WebAuthn エクステンションが認証情報をロードして保存できるようにするには、link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnUserProvider.html[`WebAuthnUserProvider`] を実装する Bean を 定義する必要があります。ここで、Quarkus に対してデータモデルを WebAuthn の セキュリティーモデルに変換する方法を指定します。

source: You need to make sure that `apicurio-registry-serdes-avro-serde` dependency and the REST client `apicurio-common-rest-client-vertx` dependency are set to compatible versions:
ja_jp: `apicurio-registry-serdes-avro-serde` の依存関係と REST クライアント `apicurio-common-rest-client-vertx` の依存関係が互換性のあるバージョンに設定されていることを確認する必要があります：

source: You need to make sure that `apicurio-registry-serdes-json-schema-serde` dependency and the REST client `apicurio-common-rest-client-vertx` dependency are set to compatible versions:
ja_jp: `apicurio-registry-serdes-json-schema-serde` の依存関係と REST クライアント `apicurio-common-rest-client-vertx` の依存関係が、互換性のあるバージョンに設定されていることを確認する必要があります。

source: You need to make sure your payload can be encoded to JSON.
ja_jp: ペイロードが JSON にエンコードできることを確認する必要があります。

source: You need to name the Jaeger service or get the IP running the following command to configure the exporter endpoint.
ja_jp: エクスポーターエンドポイントを設定するには、Jaegerサービスに名前を付けるか、以下のコマンドを実行してIPを取得する必要があります。

source: You need to obtain the token from a standard OAuth2 authentication server (https://www.keycloak.org/[Keycloak] for example) using the token endpoint.
ja_jp: 標準的なOAuth2認証サーバー（例えば https://www.keycloak.org/[Keycloak] ）から、トークンのエンドポイントを使用してトークンを取得する必要があります。

source: You need to place them in your extension's xref:building-my-first-extension.adoc#description-of-a-quarkus-extension[`deployment`] module's `/dev-templates` resource folder, like this page for the xref:cache.adoc[`quarkus-cache` extension]:
ja_jp: xref:cache.adoc[`quarkus-cache` エクステンション]: に対するこのページのように、エクステンションの xref:building-my-first-extension.adoc#description-of-a-quarkus-extension[`deployment`] モジュールの `/dev-templates` リソース フォルダーに配置する必要があります。

source: You need to provide the URL to an LDAP server. This example requires the LDAP server to have imported link:{quarkus-blob-url}/test-framework/ldap/src/main/resources/quarkus-io.ldif[this LDIF file].
ja_jp: LDAPサーバーへのURLを提供する必要があります。この例では、LDAPサーバーが link:{quarkus-blob-url}/test-framework/ldap/src/main/resources/quarkus-io.ldif[このLDIFファイル] をインポートしている必要があります。

source: You need to provide the URL to an LDAP server. This example requires the LDAP server to have imported {quarkus-blob-url}/test-framework/ldap/src/main/resources/quarkus-io.ldif[this LDIF file].
ja_jp: LDAPサーバーのURLを指定する必要があります。この例では、 {quarkus-blob-url}/test-framework/ldap/src/main/resources/quarkus-io.ldif[このLDIFファイル]をインポートしたLDAPサーバーが必要です。

source: You need to register the generated Protobuf schemas with Infinispan Server to perform queries or convert from `Protobuf` to other media types such as `JSON`.
ja_jp: クエリを実行したり、 `Protobuf` から `JSON` のような他のメディアタイプに変換するには、生成された Protobuf スキーマを Infinispan サーバー に登録する必要があります。

source: You need to replace `cache-name` in all of the following properties with the real name of the cache you want to configure.
ja_jp: 以下のすべてのプロパティーで `cache-name` を設定したいキャッシュの実名に置き換える必要があります。

source: You need to replace `cache-name` in all the following properties with the real name of the cache you want to configure.
ja_jp: 以下のすべてのプロパティーで `cache-name` を設定したいキャッシュの実名に置き換える必要があります。

source: You need to specify a `KeyStore` password in `application.properties` for Quarkus be able to extract secrets from the keystore. This keystore password is a sensitive value, and therefore you should consider how to minimize a risk of leaking it and how to protect it.
ja_jp: Quarkusがキーストアからシークレットを抽出できるようにするには、 `application.properties` で `KeyStore` パスワードを指定する必要があります。 このキーストアのパスワードは機密性の高い値であるため、漏洩のリスクを最小限に抑え、保護する方法を検討する必要があります。

source: You need to specify the introspection URL of your authentication server and the `client-id` / `client-secret` that your application will use to authenticate itself to the authentication server. + The extension will then use this information to validate the token and recover the information associate with it.
ja_jp: 認証サーバーのイントロスペクション URL と、アプリケーションが認証サーバーへの認証に使用する `client-id` / `client-secret` を指定する必要があります。+ エクステンションはこの情報を使ってトークンを検証し、関連する情報を復元します。

source: You need to specify the introspection URL of your authentication server and the `client-id` / `client-secret` that your application will use to authenticate itself to the authentication server. + The extension will then use this information to validate the token and recover the information associated with it.
ja_jp: 認証サーバーの イントロスペクションURL と、アプリケーションが認証サーバーへの認証に使用する `client-id` / `client-secret` を指定する必要があります。+ エクステンションは、この情報を使ってトークンを検証し、トークンに関連する情報を復元します。

source: You need to switch on 2-Step Verification at https://myaccount.google.com/security in order to access the App passwords page.
ja_jp: App passwords ページにアクセスするには、 https://myaccount.google.com/security 、2段階認証をオンにする必要があります。

source: You need to tell each Container about the type of objects for which it will be responsible. In this example it will be instances that implement the FlightService interface.
ja_jp: 各コンテナーに、処理するオブジェクトの種類を伝える必要があります。この例では、FlightService インターフェースを実装したインスタンスになります。

source: You need to use the JAAS `PlainLoginModule`.
ja_jp: JAAS の `PlainLoginModule` を使用する必要があります。

source: You now can get your client id and secret. Don't forget to also add the authorized redirect URLs for your application:
ja_jp: これでクライアント ID とシークレットを取得できます。アプリケーションの承認済みリダイレクト URL も追加することを忘れないでください。

source: You now can get your client id and secret:
ja_jp: これでクライアント ID とシークレットを取得できます。

source: You now have all the information you need to study the coverage of your tests! But remember, some code that is not covered is certainly not well tested. But some code that is covered is not necessarily *well* tested. Make sure to write good tests!
ja_jp: これで、テストのカバレッジを研究するために必要なすべての情報を手に入れることができました!しかし、カバーされていないコードは、確かに十分にテストされていないものがありますが、カバーされているコードの中には、必ずしも *十分に* テストされていないものもあることを覚えておいてください。良いテストを書くようにしましょう!

source: You often need to execute custom actions when the application starts and clean up everything when the application stops.
ja_jp: アプリケーションの起動時にカスタムアクションを実行し、アプリケーションの停止時にすべてをクリーンアップする必要があることがよくあります。

source: You often need to execute custom actions when the application starts and clean up everything when the application stops. This guide explains how to:
ja_jp: アプリケーションの起動時にカスタムアクションを実行し、アプリケーションの停止時にすべてをクリーンアップする必要があることがよくあります。このガイドでは、以下の方法を説明します:

source: You often need to execute custom actions when the application starts and clean up everything when the application stops. This guide explains how to be notified when an application stops or starts.
ja_jp: アプリケーションの起動時にカスタムアクションを実行し、アプリケーションの停止時にすべてをクリーンアップする必要があることがよくあります。このガイドでは、アプリケーションの停止時や起動時に通知を受ける方法を説明します。

source: You only have to configure `quarkus.oidc.application-type=web-app` to get started with the authorization code flow xref:security-openid-connect-dev-services.adoc[in the dev mode].
ja_jp: xref:security-openid-connect-dev-services.adoc[開発モード] で認可コードフローを開始するには、 `quarkus.oidc.application-type=web-app` を設定するだけです。

source: You only need an annotation to tag the record to be marshalled by Protostream
ja_jp: Protostreamによってマーシャリングされるレコードにタグを付けるアノテーションが必要なだけです。

source: You only need one property to get started with supporting bearer access tokens:
ja_jp: ベアラーアクセストークンのサポートを開始するために必要なプロパティーは 1 つだけです。

source: You only need to define your configuration for production with the `%prod.` prefix. The dev mode one is taken care of.
ja_jp: 本番用の設定を、 `%prod.` のプレフィックスで定義するだけでOKです。開発モード用のものは準備されています。

source: You only need to inject the tokens if the endpoint needs to use the ID token to interact with the currently authenticated user or use the access token to access a downstream service on behalf of this user.
ja_jp: トークンを注入する必要があるのは、エンドポイントが ID トークンを使って現在認証されているユーザーとやり取りする必要がある場合、あるいはアクセストークンを使ってそのユーザーに代わって下流のサービスにアクセスする必要がある場合だけです。

source: You or may not need to acquire an initial registration access token. If you don't, then you will have to enable one or more client registration policies in your OIDC provider's dashboard. For example, see https://www.keycloak.org/docs/latest/securing_apps/#_client_registration_policies[Keycloak client registration policies].
ja_jp: 初期登録アクセストークンを取得する必要がある場合とない場合があります。必要ない場合は、OIDC プロバイダーのダッシュボードで 1 つ以上のクライアント登録ポリシーを有効にする必要があります。たとえば、 https://www.keycloak.org/docs/latest/securing_apps/#_client_registration_policies[Keycloak クライアント登録ポリシー] を参照してください。

source: You persist that entity into a database,
ja_jp: そのエンティティーをデータベースに永続化します。

source: You prefer to stay close to the Maven/Gradle ecosystem (Node.js is not needed), it uses an extremely fast bundler for the web (esbuild)
ja_jp: Maven/Gradle エコシステムに近い状態を維持することを好む。 (Node.js は必要ありません)、Web 用の非常に高速なバンドラー (esbuild) を使用します。

source: You provide an extension-specific `HTTP`, the support of which conflicts with the support of those offered by `quarkus-smallrye-jwt` and `Vert.x HTTP`, such as `Quarkus AWS Lambda`.
ja_jp: エクステンション固有の `HTTP` を指定し、そのサポートは `quarkus-smallrye-jwt` および `Vert.x HTTP` (`Quarkus AWS Lambda` など) によって提供されるサポートと競合している場合。

source: You provide the groupId and artifactId (so that we can look up the version) and a Name and optionally a url.
ja_jp: groupId と artifactId (バージョンを検索できるように) および名前と、任意で URL を提供します。

source: You receive an HTTP request with a payload,
ja_jp: ペイロードを含む HTTP リクエストを受信します。

source: You remember we checked the size of the native executable with SSL enabled? Let's check again with SSL support entirely disabled:
ja_jp: SSLを有効にしたネイティブ実行可能ファイルのサイズを確認したのを覚えていますか?SSLサポートを完全に無効にした状態でもう一度確認してみましょう:

source: You return that channel as a `Publisher` or a `Multi` from the HTTP method
ja_jp: そのチャネルを HTTP メソッドから `Publisher` または `Multi` として返します

source: You see similar patterns with resources. An application might try to load a configuration file or a service descriptor that doesn't exist. That's perfectly normal, the only way to know it's missing is to try.
ja_jp: リソースでも同様のパターンが見られます。アプリケーションが存在しない設定ファイルやサービス記述子をロードしようとすることがあります。それは完全に正常であり、欠落していることを知る唯一の方法は試してみることです。

source: You send the entity to a Kafka topic
ja_jp: エンティティーを Kafka トピックに送信します。

source: You should add a `.waitingFor` call to the container construction, to wait for the container to start. For example
ja_jp: コンテナーが起動するまで待つには、コンテナー構築に `.waitingFor` 呼び出しを追加する必要があります。以下に例を示します。

source: You should already have an xref:building-my-first-extension.adoc[extension structure] in place
ja_jp: すでに xref:building-my-first-extension.adoc[エクステンション構造] が準備されている。

source: You should also be able to get the certificate as follows:
ja_jp: また、以下のように証明書を取得できるようにしておきましょう:

source: You should always use bounded near caches by specifying the maximum number of entries they can contain.
ja_jp: キャッシュに格納できるエントリーの最大数を指定し、常に境界付けられたニアキャッシュを使用する必要があります。

source: You should be able to access your Keycloak Server at http://localhost:8180/auth[localhost:8180/auth] or https://localhost:8543/auth[localhost:8543/auth].
ja_jp: Keycloakサーバーには、 link:http://localhost:8180/auth[localhost:8180/auth] または link:https://localhost:8543/auth[localhost:8543/auth] でアクセスできるはずです。

source: You should be able to access your Keycloak Server at http://localhost:8180/auth[localhost:8180/auth].
ja_jp: Keycloakサーバーには、 link:http://localhost:8180/auth[localhost:8180/auth] でアクセスできるはずです。

source: You should be able to access your Keycloak Server at http://localhost:8180[localhost:8180].
ja_jp: http://localhost:8180[localhost:8180] で Keycloak サーバーにアクセスできるはずです。

source: You should be able to access your Keycloak Server at https://localhost:8543[localhost:8543].
ja_jp: Keycloakサーバーには、 link:https://localhost:8543/auth[localhost:8543/auth] でアクセスできるはずです。

source: You should be able to use it in place of any JAX-RS implementation, but on top of that it has great performance for both blocking and non-blocking endpoints, and a lot of new features on top of what JAX-RS provides.
ja_jp: JAX-RSの実装の代わりに使うことができるはずですが、それに加えて、ブロッキングエンドポイントとノンブロッキングエンドポイントの両方で優れたパフォーマンスを発揮し、JAX-RSが提供する機能に加えて多くの新機能を備えています。

source: You should be able to use it in place of any Jakarta REST implementation, but on top of that it has great performance for both blocking and non-blocking endpoints, and a lot of new features on top of what Jakarta REST provides.
ja_jp: Jakarta RESTの実装として使えるはずですが、その上、ブロッキングとノンブロッキングの両方のエンドポイントに対して素晴らしいパフォーマンスを発揮し、Jakarta RESTが提供する機能の上に多くの新機能を備えています。

source: You should be familiar with the overview of what a xref:doc-concept.adoc#tutorial[Tutorial] is.
ja_jp: xref:doc-concepts.adoc#tutorial[チュートリアル] とは何かについての概要に精通している必要があります。

source: You should be familiar with the overview of what a xref:doc-concepts.adoc#tutorial[Tutorial] is.
ja_jp: xref:doc-concepts.adoc#tutorial[チュートリアル] とは何かについての概要に精通している必要があります。

source: You should be redirected again to the login page at Keycloak. However, now you are going to authenticate using a different `realm`.
ja_jp: Keycloak のログインページに再度リダイレクトされます。ただし、ここでは別の `realm` を使用して認証します。

source: You should get the expected `Hello bob` message back.
ja_jp: 期待通りの `Hello bob` メッセージが返ってくるはずです。

source: You should get the name when you access the Quarkus endpoint directly from the browser. Clear the browser cookie cache, access http://localhost:8080/hello and yet again, you get `Hello, auth0|60e5a305e8da5a006aef5471` returned. Hmm, what is wrong ?
ja_jp: ブラウザーから Quarkus エンドポイントに直接アクセスすると、名前が返されるはずです。しかし、ブラウザーの Cookie キャッシュをクリアして http://localhost:8080/hello にアクセスしても、再度 `Hello, auth0|60e5a305e8da5a006aef5471` が返されます。何が間違っているのでしょうか?

source: You should have a containerised version of your external service (not all Dev Services rely on containers, but most do)
ja_jp: 外部サービスのコンテナー化されたバージョンがある (すべての Dev Service がコンテナーに依存しているわけではありませんが、ほとんどは依存しています)。

source: You should not call methods annotated with `@Incoming` and/or `@Outgoing` directly from your code. They are invoked by the framework. Having user code invoking them would not have the expected outcome.
ja_jp: コードから直接 `@Incoming` や `@Outgoing` のアノテーションが付けられたメソッドを呼び出さないでください。これらはフレームワークによって呼び出されます。ユーザーコードがそれらを呼び出すと、期待された結果にはなりません。

source: You should not return a `CompletionStage` or `Uni` when using `@Transactional`, as all transaction commits will happen on a single thread, which impacts performance.
ja_jp: `@Transactional` を使用する場合は、すべてのトランザクションコミットが単一のスレッドで行われ、パフォーマンスに影響するため、 `CompletionStage` または `Uni` を返さないでください。

source: You should obtain the following response:
ja_jp: 次のような応答が得られるはずです。

source: You should only use `list` and `stream` methods if your collection contains small enough data sets. For larger data sets you can use the `find` method equivalents, which return a `PanacheQuery` on which you can do paging:
ja_jp: `list` および `stream` メソッドは、コレクションに含まれるデータセットが十分に小さい場合にのみ使用してください。より大きなデータセットの場合は、同等の `find` メソッドを使用して、ページングが可能な `PanacheQuery` を返すことができます。

source: You should only use `list` and `stream` methods if your table contains small enough data sets. For larger data sets you can use the `find` method equivalents, which return a `PanacheQuery` on which you can do paging:
ja_jp: `list` および `stream` メソッドは、テーブルに含まれるデータセットが十分に小さい場合にのみ使用してください。より大きなデータセットの場合は、同等の `find` メソッドを使用して、ページングが可能な `PanacheQuery` を返すことができます:

source: You should only use a single HTTP framework together with the AWS Lambda extension to avoid unexpected conflicts and errors.
ja_jp: 予期しない競合やエラーを回避するには、AWS Lambda エクステンションと一緒に単一の HTTP フレームワークのみを使用する必要があります。

source: You should only use single HTTP framework together with AWS Lambda extension to avoid unexpected conflicts and errors.
ja_jp: 予期しない競合やエラーを回避するには、AWS Lambda エクステンションと一緒に単一の HTTP フレームワークのみを使用する必要があります。

source: You should only use the `list` methods if your table contains small enough data sets. For larger data sets you can use the `find` method equivalents, which return a `PanacheQuery` on which you can do paging:
ja_jp: `list` メソッドは、テーブルに含まれるデータセットが十分に小さい場合にのみ使用してください。より大きなデータセットの場合は、同等の `find` メソッドを使用して、ページングが可能な `PanacheQuery` を返すことができます:

source: You should remove the old OpenTracing properties, starting with `quarkus.jaeger.*` from the `application.properties` file, like in this example:
ja_jp: 次の例のように、 `application.properties` ファイルから `quarkus.jaeger.*` から始まる古い OpenTracing プロパティーを削除する必要があります。

source: You should remove the optional ports you don't need them.
ja_jp: オプションのポートは必要ないものは外しておいた方が良いです。

source: You should see a JSON object containing some basic information about the REST Client extension.
ja_jp: REST Client extensionに関する基本情報を含む JSON オブジェクトが表示されます。

source: You should see a JSON object containing some basic information about this extension.
ja_jp: このエクステンションに関する基本的な情報を含む JSON オブジェクトが表示されるはずです。

source: You should see a line in the log for each class written to the directory:
ja_jp: ディレクトリーに書き込まれた各クラスのログに行が表示されます。

source: You should see a long list of symbols that match that pattern.
ja_jp: そのパターンに一致するシンボルの長いリストが表示されるはずです。

source: You should see a personalised message: `Hello Bloom`.
ja_jp: パーソナライズされたメッセージ `Hello Bloom` が表示されます。

source: You should see an output similar to:
ja_jp: 以下のような出力が表示されるはずです。

source: You should see in the application log something like:
ja_jp: アプリケーションログに以下のような内容が表示されているはずです。

source: You should see log statements from the `producer` application about messages being sent to the "temperature-values" topic.
ja_jp: `producer` アプリケーションから、"temperature-values" トピックに送信されたメッセージに関するログステートメントが表示されるはずです。

source: You should see new values arrive as the producer continues to emit temperature measurements, each value on the outbound topic showing the minimum, maximum and average temperature values of the represented weather station.
ja_jp: プロデューサが温度測定値を出力し続けると、新しい値が表示され、送信トピックの各値は、表現された気象観測所の最小、最大、および平均温度値を表示します。

source: You should see some requests time out with `org.eclipse.microprofile.faulttolerance.exceptions.TimeoutException`. Requests that do not time out should show two recommended coffee samples in JSON.
ja_jp: `org.eclipse.microprofile.faulttolerance.exceptions.TimeoutException` でいくつかのリクエストがタイムアウトになるはずです。タイムアウトにならなかったリクエストでは、JSONに2つのおすすめコーヒーサンプルが表示されます。

source: You should see the content of the file printed in the console.
ja_jp: コンソールにファイルの内容が表示されるはずです。

source: You should see the following down the bottom of the screen after the application is stopped:
ja_jp: アプリケーションが停止した後、画面の下に以下のように表示されます:

source: You should see the following message: "I've said hello to Bloom".
ja_jp: "I've said hello to Bloom" というメッセージが表示されます。

source: You should see the following pair of log messages for every expression and section used in a template:
ja_jp: テンプレートで使用されるすべての式とセクションについて、次のような一対のログメッセージが表示されるはずです。

source: You should test that OpenTelemetry output for applications using your extension have properly-defined spans. You may need to do extra work to ensure spans are created with the right tracing ID. For example, extensions which have reactive internals should support xref:duplicated-context.adoc[duplicated contexts] for correct context propagation.
ja_jp: エクステンションを使用するアプリケーションの OpenTelemetry 出力に、適切に定義されたスパンが含まれているかどうかをテストする必要があります。スパンが適切なトレース ID で作成されるようにするには、追加の作業が必要になる場合があります。 たとえば、リアクティブな内部構造を持つエクステンションは、正しいコンテキスト伝播のために xref:duplicated-context.adoc[重複したコンテキスト] をサポートする必要があります。

source: You start with declaring one or more OIDC client registration configurations, for example:
ja_jp: まず、1 つ以上の OIDC クライアント登録設定を宣言します。次に例を示します。

source: You still need to ship a JVM with your application.
ja_jp: アプリケーションと一緒に JVM を配布する必要があります。

source: You talked about some qualifiers?
ja_jp: 修飾子の話をしましたか?

source: You use only the `quarkus.oidc.authentication.session-age-extension` property to significantly extend the session lifespan, if required. You use the `quarkus.oidc.token.lifespan-grace` property only to consider some small clock skews.
ja_jp: 必要に応じて、 `quarkus.oidc.authentication.session-age-extension` プロパティーのみを使用して、セッションの有効期間を大幅に延長します。 `quarkus.oidc.token.lifespan-grace` プロパティーは、小さなクロックスキューを考慮する場合にのみ使用します。

source: You use very specific bundling options or specific tools in your build process
ja_jp: ビルドプロセスで特定のバンドルオプションやツールを使用している。

source: You want to reduce boilerplate and configuration
ja_jp: ボイラープレートや設定を減らしたい。

source: You want to start using your entities in a reactive application? Let's start by importing Hibernate Reactive in your `pom.xml` as well as a data source for your database:
ja_jp: リアクティブアプリケーションでエンティティーを使い始めたいですか？まずは `pom.xml` に Hibernate Reactive とデータベースのデータソースをインポートすることから始めましょう。

source: You want to write Javascript unit tests (such as Jest, Jasmine, ..), it is not possible with the Web Bundler. However, you could publish a components library on NPM and consume it from the Web Bundler.
ja_jp: Javascript ユニットテスト (Jest、Jasmine など) を記述する。Web Bundler では不可能ですが、NPM でコンポーネントライブラリーを公開し、Web Bundler から使用することはできます。

source: You were redirected by GitHub to the `http://localhost:8080/login` callback handler, but Quarkus OIDC completes the authorization code flow and acquires the GitHub access token first.
ja_jp: GitHub によって `http://localhost:8080/login` コールバックハンドラーにリダイレクトされましたが、Quarkus OIDC がまず認可コードフローを完了し、GitHub アクセストークンを取得します。

source: You were redirected by GitHub to the `http://localhost:8080/login` callback route handler which completed the authorization code flow and acquired the GitHub access token.
ja_jp: GitHub によって `http://localhost:8080/login` コールバックルートハンドラーにリダイレクトされました。ここで認可コードフローが完了し、GitHub アクセストークンが取得されました。

source: You were redirected by GitHub to the `http://localhost:8080/login` virtual callback handler, Quarkus OIDC completed the authorization code flow and acquired the GitHub access token.
ja_jp: GitHub によって `http://localhost:8080/login` 仮想コールバックハンドラーにリダイレクトされ、Quarkus OIDC が認可コードフローを完了して GitHub アクセストークンを取得しました。

source: You were redirected by Quarkus OIDC to GitHub to login
ja_jp: Quarkus OIDC によって GitHub にリダイレクトされ、ログインしました。

source: You were redirected by Quarkus OIDC to GitHub to login.
ja_jp: Quarkus OIDC によって GitHub にリダイレクトされ、ログインしました。

source: You were redirected by Quarkus OIDC to the `original` request URL, `http://localhost:8080/protected`. The OIDC redirect query parameters such as `code` and `state` are also dropped during this final redirect.
ja_jp: Quarkus OIDC によって、`元の` リクエスト URL である `http://localhost:8080/protected` にリダイレクトされました。この最終的なリダイレクト中に、 `code` や `state` などの OIDC リダイレクトクエリーパラメーターも削除されます。

source: You were redirected by Vert.x OIDC to GitHub to login.
ja_jp: Vert.x OIDC によってログインのために GitHub にリダイレクトされました。

source: You were redirected by Vert.x OIDC to the `original` request URL, `http://localhost:8080/protected`.
ja_jp: Vert.x OIDC によって、`元の` リクエスト URL である `http://localhost:8080/protected` にリダイレクトされました。

source: You were waiting for it and it is finally here: Quarkus 2.0.0.Final with all its bells and whistles.
ja_jp: 待ってました！ついに登場です。Quarkus 2.0.0.Finalは、すべての機能を備えています。

source: You will also have to explicitly configure Vert.x to use the native transport. In `application.properties` add:
ja_jp: また、Vert.xでネイティブトランスポートを使用するように明示的に設定する必要があります。 `application.properties` に次を追加します。

source: You will also need to choose, and add, the Quarkus extension for your relational database driver.
ja_jp: また、リレーショナルデータベースドライバー用の Quarkus エクステンションを選択して追加する必要があります。
